-- MySQL dump 10.13  Distrib 8.0.11, for Win64 (x86_64)
--
-- Host: localhost    Database: db1
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `stuclass`
--

DROP TABLE IF EXISTS `stuclass`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `stuclass` (
  `xh` varchar(255) NOT NULL COMMENT '学生学号；',
  `xm` varchar(255) NOT NULL COMMENT '学生姓名',
  `xb` varchar(255) NOT NULL COMMENT '学生性别；',
  `zym` varchar(255) NOT NULL COMMENT '学生专业名',
  `yxm` varchar(255) NOT NULL COMMENT '学生学院名',
  PRIMARY KEY (`xh`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stuclass`
--

LOCK TABLES `stuclass` WRITE;
/*!40000 ALTER TABLE `stuclass` DISABLE KEYS */;
INSERT INTO `stuclass` VALUES ('2017211557','赵梦娇','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211558','王若晗','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211560','姚婷婷','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211575','丁强','男','信息安全','网络空间安全与信息法学院'),('2017211576','王志文','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211579','王森','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211580','蔡青杉','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211588','李金洋','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211603','范婷雯','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211604','万柯利','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211605','宁小勇','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211606','胡骦月','女','信息安全','网络空间安全与信息法学院'),('2017211608','谭舒月','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211614','闫昊','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211617','刘庆阳','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211622','程宇杰','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211623','包锦心','男','信息安全','网络空间安全与信息法学院'),('2017211624','周悦宁','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211625','邓涵文','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211645','刘炳迪','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211646','吴瑕','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211647','董倩','女','信息安全','网络空间安全与信息法学院'),('2017211648','张雪珂','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211649','林静雯','女','信息安全','网络空间安全与信息法学院'),('2017211650','唐于滟','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211651','丁珊','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211652','王银','女','信息安全','网络空间安全与信息法学院'),('2017211653','梁雨婷','女','信息安全','网络空间安全与信息法学院'),('2017211654','刘美君','女','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211655','颜逸','女','信息安全','网络空间安全与信息法学院'),('2017211656','邵孟飞','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211657','陈文滔','男','信息安全','网络空间安全与信息法学院'),('2017211658','王子宁','男','信息安全','网络空间安全与信息法学院'),('2017211659','杨程程','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211660','郭金松','男','信息安全','网络空间安全与信息法学院'),('2017211661','刘奕扬','男','信息安全','网络空间安全与信息法学院'),('2017211662','高子杰','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211663','伍能银','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211665','徐皙朋','男','信息安全','网络空间安全与信息法学院'),('2017211667','刘奕麟','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211668','罗心烺','男','信息安全','网络空间安全与信息法学院'),('2017211669','李南星','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211670','刘雨轩','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211671','苏心游','男','信息安全','网络空间安全与信息法学院'),('2017211672','赖鑫','男','信息安全','网络空间安全与信息法学院'),('2017211673','何豪','男','信息安全','网络空间安全与信息法学院'),('2017211674','陈星宇','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211676','曹晏清','男','信息安全','网络空间安全与信息法学院'),('2017211677','熊胤杰','男','信息安全','网络空间安全与信息法学院'),('2017211678','张万超','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211679','张鹏','男','信息安全','网络空间安全与信息法学院'),('2017211680','陈志豪','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211682','龚强生','男','信息安全','网络空间安全与信息法学院'),('2017211683','陆正鹏','男','信息安全专业卓越工程师班','网络空间安全与信息法学院'),('2017211684','白雨松','男','信息安全','网络空间安全与信息法学院'),('2017211685','杨童麟','男','信息安全','网络空间安全与信息法学院'),('2017211686','文超澜','男','信息安全','网络空间安全与信息法学院'),('2017211687','刘汉立','男','信息安全','网络空间安全与信息法学院');
/*!40000 ALTER TABLE `stuclass` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-10  0:05:16
